app/controllers/comments_controller.rb

  def index
    respond_to do |format|
      format.html
      format.json { render json: Comment.all.to_json }
---
SELECT "comments".* FROM "comments"

  def create
    respond_to do |format|
      format.json do
        comment = Comment.create(
          body:     params['comment']['body'],
          user_id:  params['comment']['user_id'],
          username: params['comment']['username'],
          img_url:  params['comment']['img_url'],
          topic_id: params['comment']['topic_id'],
          agree:    params['comment']['agree']
        )
---
INSERT INTO "comments" ("agree", "body", "created_at", "topic_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["agree", true], ["body", "fd"], ["created_at", Mon, 03 Feb 2014 20:15:43 UTC +00:00], ["topic_id", nil], ["updated_at", Mon, 03 Feb 2014 20:15:43 UTC +00:00], ["user_id", nil]]

  def destroy
    respond_to do |format|
      format.json do
        comment = Comment.find(params[:id])
        comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", "3"]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]