app/controllers/topics_controller.rb

SELECT "topics".* FROM "topics"
---
  def index
    respond_to do |format|
      format.html
      format.json { render json: Topic.all.to_json }

INSERT INTO "topics" ("body", "created_at", "link", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "i hopeso"], ["created_at", Sat, 01 Feb 2014 21:20:19 UTC +00:00], ["link", nil], ["title", "does this work"], ["updated_at", Sat, 01 Feb 2014 21:20:19 UTC +00:00], ["user_id", nil]]
---
  def create
    respond_to do |format|
      format.json do
        topic = Topic.create( title: params['topic']['title'],
                              link:  params['topic']['link'],
                              body:  params['topic']['body']
                            )

SELECT "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT 1  [["id", 6]]
---
  def show
    respond_to do |format|
      format.html do
      end

      format.json do
        topic = Topic.find(params[:id])

SELECT "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "topics" WHERE "topics"."id" = $1  [["id", 1]]
---
  def destroy
    respond_to do |format|
      format.json do
        topic = Topic.find(params[:id])
        topic.destroy